БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_РаботаСФайламиКлиент/Ext/Module.bsl
Функция ПолучитьОбщийМодульРаботыСфайлами() Экспорт
	    
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Возврат CW_ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияShareКлиентСервер");
	КонецЕсли;

	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Возврат CW_ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиентСервер");
	КонецЕсли;
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляКазахстана") Тогда  
		Возврат CW_ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиентСервер");
	КонецЕсли; 
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляУзбекистана") Тогда  
		Возврат CW_ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиентСервер");
	КонецЕсли;
	
КонецФункции

Процедура ПрикрепитьФайлы(МассивВладельцев, ЗапрашиватьТипФайлаПриДобавленииВАрхив, ОбработчикРезультата=Неопределено) ЭКспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивВладельцев", МассивВладельцев);
	ДополнительныеПараметры.Вставить("ЗапрашиватьТипФайлаПриДобавленииВАрхив", ЗапрашиватьТипФайлаПриДобавленииВАрхив);  
	ДополнительныеПараметры.Вставить("ОбработчикРезультата", ОбработчикРезультата);  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПомещенияФайла", ЭтотОбъект, ДополнительныеПараметры); 
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок  			= "Выберите файлы";
	ПараметрыДиалога.Фильтр					= "(*.*)|*.*";
	ПараметрыДиалога.МножественныйВыбор	 	= Истина;  
	НачатьПомещениеФайловНаСервер(ОписаниеОповещения,,,ПараметрыДиалога, Новый УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ОбработкаПомещенияФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ПомещенныеФайлы <> Неопределено И ПомещенныеФайлы.Количество() > 0 Тогда
		
		ПараметрыВыбора = новый Структура;
		ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);  
		
		мПомещенныеФайлы = Новый Массив;
		Для Каждого ПомещенныйФайл из ПомещенныеФайлы Цикл 
			
			ПозицияТочки 	= СтрНайти(ПомещенныйФайл.СсылкаНаФайл.Имя, ".", НаправлениеПоиска.СКонца);
			Расширение 		= Сред(ПомещенныйФайл.СсылкаНаФайл.Имя, ПозицияТочки);

			ДанныеФайла = Новый Структура;
			ДанныеФайла.Вставить("Имя", 		ПомещенныйФайл.СсылкаНаФайл.Имя);
			ДанныеФайла.Вставить("Расширение", 	Расширение);
			ДанныеФайла.Вставить("Хранение", 	ПомещенныйФайл.Адрес); 
			
			мПомещенныеФайлы.Добавить(ДанныеФайла);	
		КонецЦикла;
		
		ДополнительныеПараметры.Вставить("ПомещенныеФайлы", мПомещенныеФайлы);  
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПомещениеФалов", ЭтотОбъект, ДополнительныеПараметры);
		
		Если ДополнительныеПараметры.ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
			ОткрытьФорму("Справочник.CW_ТипыДокументовФайловогоАрхива.ФормаВыбора",ПараметрыВыбора, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ВыполнитьОбработкуОповещения(ОписаниеОповещения,Неопределено);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры   

Процедура ПродолжитьПомещениеФалов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено 
		ИЛИ НЕ ДополнительныеПараметры.ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда  
		
		Успешно = CW_РаботаСФайламиСервер.ПрикрепитьФайлы(ДополнительныеПараметры.ПомещенныеФайлы,  ДополнительныеПараметры.МассивВладельцев, РезультатВыбора);
		Если ДополнительныеПараметры.Свойство("ОбработчикРезультата")
			И ДополнительныеПараметры.ОбработчикРезультата <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработчикРезультата, Успешно);
		КонецЕсли;  
		
		Оповестить("ОбновитьНаличиеПрикрепленныхФайлов");
	Иначе  
		
		ПоказатьПредупреждение(,"Не выбран тип документа. Добавление файла отменено!");  
		
	Конецесли;   
	
КонецПроцедуры

// Открывает файл для просмотра или редактирования.
// Если файл открывается для просмотра, тогда получает файл в рабочий каталог пользователя,
// при этом ищет файл в рабочем каталоге и предлагает открыть существующий или получить файл с сервера.
// Если файл открывается для редактирования, тогда открывает файл в рабочем каталоге (если есть) или
// получает его с сервера.
//
// Параметры:
//  ДанныеФайла       - см. РаботаСФайлами.ДанныеФайла.
//  ДляРедактирования - Булево - Истина, если файл открывается для редактирования, иначе Ложь.
//
Процедура ОткрытьФайл(Знач ДанныеФайла) Экспорт
	
	CW_РаботаСФайламиСлужебныйКлиент.ОткрытьФайл(ДанныеФайла); 
	
КонецПроцедуры  

Процедура СохранитьКак(Знач ДанныеФайла) Экспорт
	
	Если ДанныеФайла.СпособХранения = 1 Тогда  
		ПоказатьПредупреждение(,"Для данного способа хранения файла сохранение невозможно!");
		Возврат;
	КонецЕсли;
	
	CW_РаботаСФайламиСлужебныйКлиент.СохранитьКак(ДанныеФайла); 
	
КонецПроцедуры 


Процедура АдресКартинкиФайловНажатие(Форма, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка  = Ложь;     
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Перед добавлением файлов необходимо записать объект");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОбъектАрхива", Форма.Объект.Ссылка);
	ОткрытьФорму("Справочник.CW_ОбъектыАрхива.Форма.ФайлыОбъекта", ПараметрыФормы, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура АдресКартинкиФайловПеретаскивание(Форма, ПараметрыПеретаскивания, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Перед добавлением файлов необходимо записать объект");
		Возврат;
	КонецЕсли;
	
	ЗапрашиватьТипФайлаПриДобавленииВАрхив = CW_РаботаСФайламиСервер.ЗапрашиватьТипФайлаПриДобавленииВАрхив();

	ПомещаемыеФайлы = Новый Массив;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Для Каждого ПомещаемыйФайл из ПараметрыПеретаскивания.Значение Цикл
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПомещаемыйФайл.Файл.ПолноеИмя));
		КонецЦикла;
	Иначе
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя));
	КонецЕсли;           
	
	МассивВладельцев = Новый Массив;
	МассивВладельцев.Добавить(Форма.Объект.Ссылка);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма",				Форма);
	ДополнительныеПараметры.Вставить("МассивВладельцев",	МассивВладельцев);
	ДополнительныеПараметры.Вставить("ЗапрашиватьТипФайлаПриДобавленииВАрхив", ЗапрашиватьТипФайлаПриДобавленииВАрхив);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПомещенияФайлаПеретаскивание", ЭтотОбъект, ДополнительныеПараметры); 
	НачатьПомещениеФайлов(ОписаниеОповещения, ПомещаемыеФайлы, Ложь, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ОбработкаПомещенияФайлаПеретаскивание(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ПомещенныеФайлы <> Неопределено И ПомещенныеФайлы.Количество() > 0 Тогда
		
		ПараметрыВыбора = новый Структура;
		ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);  
		
		мПомещенныеФайлы = Новый Массив;
		Для Каждого ПомещенныйФайл из ПомещенныеФайлы Цикл 
			
			ПозицияТочки 	= СтрНайти(ПомещенныйФайл.Имя, ".", НаправлениеПоиска.СКонца);
			Расширение 		= Сред(ПомещенныйФайл.Имя, ПозицияТочки);

			ДанныеФайла = Новый Структура;
			ДанныеФайла.Вставить("Имя", 		ПомещенныйФайл.Имя);
			ДанныеФайла.Вставить("Расширение", 	Расширение);
			ДанныеФайла.Вставить("Хранение", 	ПомещенныйФайл.Хранение); 
			
			мПомещенныеФайлы.Добавить(ДанныеФайла);	
		КонецЦикла;
		
		ДополнительныеПараметры.Вставить("ПомещенныеФайлы", мПомещенныеФайлы);  
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПомещениеФалов", ЭтотОбъект, ДополнительныеПараметры);
		
		Если ДополнительныеПараметры.ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
			ОткрытьФорму("Справочник.CW_ТипыДокументовФайловогоАрхива.ФормаВыбора",ПараметрыВыбора, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ВыполнитьОбработкуОповещения(ОписаниеОповещения,Неопределено);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры    

Функция ДанныеФайла(Знач ПрисоединенныйФайл, ИдентификаторФормы) Экспорт
	
	Результат = CW_РаботаСФайламиСервер.ДанныеФайла(ПрисоединенныйФайл);
	Если Результат.СпособХранения = 1 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДвоичныеДанные = ДвоичныеДанныеФайла(Результат);   
	
	Если ДвоичныеДанные = Неопределено Тогда
		СсылкаНаДвоичныеДанныеФайла = Неопределено;
	Иначе
		Если ТипЗнч(ИдентификаторФормы) = Тип("УникальныйИдентификатор") Тогда
			СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ИдентификаторФормы);
		Иначе
			СсылкаНаДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		КонецЕсли;                               
	КонецЕсли;
	
	Результат.Вставить("СсылкаНаДвоичныеДанныеФайла",  СсылкаНаДвоичныеДанныеФайла);
	
	Возврат Результат;
	
КонецФункции   

Функция ДвоичныеДанныеФайла(Результат) Экспорт
	
	Если Результат.СпособХранения = 1 Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(Результат.ИмяФайла);	
	Иначе
		ДвоичныеДанные = CW_РаботаСФайламиСервер.ДвоичныеДанныеФайла(Результат.Ссылка);
	КонецЕсли;	
	
	Возврат ДвоичныеДанные;

КонецФункции
